espressif/esp-idf/components/soc/esp32s3/include/soc/interrupt_core1_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_INTERRUPT_CORE1_REG_H_
#define _SOC_INTERRUPT_CORE1_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define DR_REG_INTERRUPT_CORE1_BASE                 DR_REG_INTERRUPT_BASE

#define INTERRUPT_CORE1_MAC_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x800)
/* INTERRUPT_CORE1_MAC_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_MAC_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_MAC_INTR_MAP_M  ((INTERRUPT_CORE1_MAC_INTR_MAP_V)<<(INTERRUPT_CORE1_MAC_INTR_MAP_S))
#define INTERRUPT_CORE1_MAC_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_MAC_INTR_MAP_S  0

#define INTERRUPT_CORE1_MAC_NMI_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x804)
/* INTERRUPT_CORE1_MAC_NMI_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_MAC_NMI_MAP  0x0000001F
#define INTERRUPT_CORE1_MAC_NMI_MAP_M  ((INTERRUPT_CORE1_MAC_NMI_MAP_V)<<(INTERRUPT_CORE1_MAC_NMI_MAP_S))
#define INTERRUPT_CORE1_MAC_NMI_MAP_V  0x1F
#define INTERRUPT_CORE1_MAC_NMI_MAP_S  0

#define INTERRUPT_CORE1_PWR_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x808)
/* INTERRUPT_CORE1_PWR_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_PWR_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_PWR_INTR_MAP_M  ((INTERRUPT_CORE1_PWR_INTR_MAP_V)<<(INTERRUPT_CORE1_PWR_INTR_MAP_S))
#define INTERRUPT_CORE1_PWR_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_PWR_INTR_MAP_S  0

#define INTERRUPT_CORE1_BB_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x80C)
/* INTERRUPT_CORE1_BB_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_BB_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_BB_INT_MAP_M  ((INTERRUPT_CORE1_BB_INT_MAP_V)<<(INTERRUPT_CORE1_BB_INT_MAP_S))
#define INTERRUPT_CORE1_BB_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_BB_INT_MAP_S  0

#define INTERRUPT_CORE1_BT_MAC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x810)
/* INTERRUPT_CORE1_BT_MAC_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_BT_MAC_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_BT_MAC_INT_MAP_M  ((INTERRUPT_CORE1_BT_MAC_INT_MAP_V)<<(INTERRUPT_CORE1_BT_MAC_INT_MAP_S))
#define INTERRUPT_CORE1_BT_MAC_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_BT_MAC_INT_MAP_S  0

#define INTERRUPT_CORE1_BT_BB_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x814)
/* INTERRUPT_CORE1_BT_BB_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_BT_BB_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_BT_BB_INT_MAP_M  ((INTERRUPT_CORE1_BT_BB_INT_MAP_V)<<(INTERRUPT_CORE1_BT_BB_INT_MAP_S))
#define INTERRUPT_CORE1_BT_BB_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_BT_BB_INT_MAP_S  0

#define INTERRUPT_CORE1_BT_BB_NMI_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x818)
/* INTERRUPT_CORE1_BT_BB_NMI_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_BT_BB_NMI_MAP  0x0000001F
#define INTERRUPT_CORE1_BT_BB_NMI_MAP_M  ((INTERRUPT_CORE1_BT_BB_NMI_MAP_V)<<(INTERRUPT_CORE1_BT_BB_NMI_MAP_S))
#define INTERRUPT_CORE1_BT_BB_NMI_MAP_V  0x1F
#define INTERRUPT_CORE1_BT_BB_NMI_MAP_S  0

#define INTERRUPT_CORE1_RWBT_IRQ_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x81C)
/* INTERRUPT_CORE1_RWBT_IRQ_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RWBT_IRQ_MAP  0x0000001F
#define INTERRUPT_CORE1_RWBT_IRQ_MAP_M  ((INTERRUPT_CORE1_RWBT_IRQ_MAP_V)<<(INTERRUPT_CORE1_RWBT_IRQ_MAP_S))
#define INTERRUPT_CORE1_RWBT_IRQ_MAP_V  0x1F
#define INTERRUPT_CORE1_RWBT_IRQ_MAP_S  0

#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x820)
/* INTERRUPT_CORE1_RWBLE_IRQ_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP  0x0000001F
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_M  ((INTERRUPT_CORE1_RWBLE_IRQ_MAP_V)<<(INTERRUPT_CORE1_RWBLE_IRQ_MAP_S))
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_V  0x1F
#define INTERRUPT_CORE1_RWBLE_IRQ_MAP_S  0

#define INTERRUPT_CORE1_RWBT_NMI_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x824)
/* INTERRUPT_CORE1_RWBT_NMI_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RWBT_NMI_MAP  0x0000001F
#define INTERRUPT_CORE1_RWBT_NMI_MAP_M  ((INTERRUPT_CORE1_RWBT_NMI_MAP_V)<<(INTERRUPT_CORE1_RWBT_NMI_MAP_S))
#define INTERRUPT_CORE1_RWBT_NMI_MAP_V  0x1F
#define INTERRUPT_CORE1_RWBT_NMI_MAP_S  0

#define INTERRUPT_CORE1_RWBLE_NMI_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x828)
/* INTERRUPT_CORE1_RWBLE_NMI_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RWBLE_NMI_MAP  0x0000001F
#define INTERRUPT_CORE1_RWBLE_NMI_MAP_M  ((INTERRUPT_CORE1_RWBLE_NMI_MAP_V)<<(INTERRUPT_CORE1_RWBLE_NMI_MAP_S))
#define INTERRUPT_CORE1_RWBLE_NMI_MAP_V  0x1F
#define INTERRUPT_CORE1_RWBLE_NMI_MAP_S  0

#define INTERRUPT_CORE1_I2C_MST_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x82C)
/* INTERRUPT_CORE1_I2C_MST_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_I2C_MST_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_I2C_MST_INT_MAP_M  ((INTERRUPT_CORE1_I2C_MST_INT_MAP_V)<<(INTERRUPT_CORE1_I2C_MST_INT_MAP_S))
#define INTERRUPT_CORE1_I2C_MST_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_I2C_MST_INT_MAP_S  0

#define INTERRUPT_CORE1_SLC0_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x830)
/* INTERRUPT_CORE1_SLC0_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SLC0_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_SLC0_INTR_MAP_M  ((INTERRUPT_CORE1_SLC0_INTR_MAP_V)<<(INTERRUPT_CORE1_SLC0_INTR_MAP_S))
#define INTERRUPT_CORE1_SLC0_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_SLC0_INTR_MAP_S  0

#define INTERRUPT_CORE1_SLC1_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x834)
/* INTERRUPT_CORE1_SLC1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SLC1_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_SLC1_INTR_MAP_M  ((INTERRUPT_CORE1_SLC1_INTR_MAP_V)<<(INTERRUPT_CORE1_SLC1_INTR_MAP_S))
#define INTERRUPT_CORE1_SLC1_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_SLC1_INTR_MAP_S  0

