espressif/esp-idf/components/soc/esp32s3/include/soc/interrupt_core1_reg.h
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x838)
/* INTERRUPT_CORE1_UHCI0_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_UHCI0_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_M  ((INTERRUPT_CORE1_UHCI0_INTR_MAP_V)<<(INTERRUPT_CORE1_UHCI0_INTR_MAP_S))
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_UHCI0_INTR_MAP_S  0

#define INTERRUPT_CORE1_UHCI1_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x83C)
/* INTERRUPT_CORE1_UHCI1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_UHCI1_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_UHCI1_INTR_MAP_M  ((INTERRUPT_CORE1_UHCI1_INTR_MAP_V)<<(INTERRUPT_CORE1_UHCI1_INTR_MAP_S))
#define INTERRUPT_CORE1_UHCI1_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_UHCI1_INTR_MAP_S  0

#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x840)
/* INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP  0x0000001F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_M  ((INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_V)<<(INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_S))
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_V  0x1F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_MAP_S  0

#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x844)
/* INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP  0x0000001F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_M  ((INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_V)<<(INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_S))
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_V  0x1F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_PRO_NMI_MAP_S  0

#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x848)
/* INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP  0x0000001F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_M  ((INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_V)<<(INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_S))
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_V  0x1F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_MAP_S  0

#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x84C)
/* INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP  0x0000001F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP_M  ((INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP_V)<<(INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP_S))
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP_V  0x1F
#define INTERRUPT_CORE1_GPIO_INTERRUPT_APP_NMI_MAP_S  0

#define INTERRUPT_CORE1_SPI_INTR_1_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x850)
/* INTERRUPT_CORE1_SPI_INTR_1_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI_INTR_1_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI_INTR_1_MAP_M  ((INTERRUPT_CORE1_SPI_INTR_1_MAP_V)<<(INTERRUPT_CORE1_SPI_INTR_1_MAP_S))
#define INTERRUPT_CORE1_SPI_INTR_1_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI_INTR_1_MAP_S  0

#define INTERRUPT_CORE1_SPI_INTR_2_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x854)
/* INTERRUPT_CORE1_SPI_INTR_2_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI_INTR_2_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI_INTR_2_MAP_M  ((INTERRUPT_CORE1_SPI_INTR_2_MAP_V)<<(INTERRUPT_CORE1_SPI_INTR_2_MAP_S))
#define INTERRUPT_CORE1_SPI_INTR_2_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI_INTR_2_MAP_S  0

#define INTERRUPT_CORE1_SPI_INTR_3_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x858)
/* INTERRUPT_CORE1_SPI_INTR_3_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI_INTR_3_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI_INTR_3_MAP_M  ((INTERRUPT_CORE1_SPI_INTR_3_MAP_V)<<(INTERRUPT_CORE1_SPI_INTR_3_MAP_S))
#define INTERRUPT_CORE1_SPI_INTR_3_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI_INTR_3_MAP_S  0

#define INTERRUPT_CORE1_SPI_INTR_4_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x85C)
/* INTERRUPT_CORE1_SPI_INTR_4_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI_INTR_4_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI_INTR_4_MAP_M  ((INTERRUPT_CORE1_SPI_INTR_4_MAP_V)<<(INTERRUPT_CORE1_SPI_INTR_4_MAP_S))
#define INTERRUPT_CORE1_SPI_INTR_4_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI_INTR_4_MAP_S  0

#define INTERRUPT_CORE1_LCD_CAM_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x860)
/* INTERRUPT_CORE1_LCD_CAM_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_LCD_CAM_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_LCD_CAM_INT_MAP_M  ((INTERRUPT_CORE1_LCD_CAM_INT_MAP_V)<<(INTERRUPT_CORE1_LCD_CAM_INT_MAP_S))
#define INTERRUPT_CORE1_LCD_CAM_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_LCD_CAM_INT_MAP_S  0

#define INTERRUPT_CORE1_I2S0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x864)
/* INTERRUPT_CORE1_I2S0_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_I2S0_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_I2S0_INT_MAP_M  ((INTERRUPT_CORE1_I2S0_INT_MAP_V)<<(INTERRUPT_CORE1_I2S0_INT_MAP_S))
#define INTERRUPT_CORE1_I2S0_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_I2S0_INT_MAP_S  0

#define INTERRUPT_CORE1_I2S1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x868)
/* INTERRUPT_CORE1_I2S1_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_I2S1_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_I2S1_INT_MAP_M  ((INTERRUPT_CORE1_I2S1_INT_MAP_V)<<(INTERRUPT_CORE1_I2S1_INT_MAP_S))
#define INTERRUPT_CORE1_I2S1_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_I2S1_INT_MAP_S  0

