espressif/esp-idf/components/soc/esp32s3/include/soc/interrupt_core1_reg.h
#define INTERRUPT_CORE1_UART_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x86C)
/* INTERRUPT_CORE1_UART_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_UART_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_UART_INTR_MAP_M  ((INTERRUPT_CORE1_UART_INTR_MAP_V)<<(INTERRUPT_CORE1_UART_INTR_MAP_S))
#define INTERRUPT_CORE1_UART_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_UART_INTR_MAP_S  0

#define INTERRUPT_CORE1_UART1_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x870)
/* INTERRUPT_CORE1_UART1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_UART1_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_UART1_INTR_MAP_M  ((INTERRUPT_CORE1_UART1_INTR_MAP_V)<<(INTERRUPT_CORE1_UART1_INTR_MAP_S))
#define INTERRUPT_CORE1_UART1_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_UART1_INTR_MAP_S  0

#define INTERRUPT_CORE1_UART2_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x874)
/* INTERRUPT_CORE1_UART2_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_UART2_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_UART2_INTR_MAP_M  ((INTERRUPT_CORE1_UART2_INTR_MAP_V)<<(INTERRUPT_CORE1_UART2_INTR_MAP_S))
#define INTERRUPT_CORE1_UART2_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_UART2_INTR_MAP_S  0

#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x878)
/* INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP  0x0000001F
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_M  ((INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_V)<<(INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_S))
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_V  0x1F
#define INTERRUPT_CORE1_SDIO_HOST_INTERRUPT_MAP_S  0

#define INTERRUPT_CORE1_PWM0_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x87C)
/* INTERRUPT_CORE1_PWM0_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_PWM0_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_PWM0_INTR_MAP_M  ((INTERRUPT_CORE1_PWM0_INTR_MAP_V)<<(INTERRUPT_CORE1_PWM0_INTR_MAP_S))
#define INTERRUPT_CORE1_PWM0_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_PWM0_INTR_MAP_S  0

#define INTERRUPT_CORE1_PWM1_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x880)
/* INTERRUPT_CORE1_PWM1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_PWM1_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_PWM1_INTR_MAP_M  ((INTERRUPT_CORE1_PWM1_INTR_MAP_V)<<(INTERRUPT_CORE1_PWM1_INTR_MAP_S))
#define INTERRUPT_CORE1_PWM1_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_PWM1_INTR_MAP_S  0

#define INTERRUPT_CORE1_PWM2_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x884)
/* INTERRUPT_CORE1_PWM2_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_PWM2_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_PWM2_INTR_MAP_M  ((INTERRUPT_CORE1_PWM2_INTR_MAP_V)<<(INTERRUPT_CORE1_PWM2_INTR_MAP_S))
#define INTERRUPT_CORE1_PWM2_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_PWM2_INTR_MAP_S  0

#define INTERRUPT_CORE1_PWM3_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x888)
/* INTERRUPT_CORE1_PWM3_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_PWM3_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_PWM3_INTR_MAP_M  ((INTERRUPT_CORE1_PWM3_INTR_MAP_V)<<(INTERRUPT_CORE1_PWM3_INTR_MAP_S))
#define INTERRUPT_CORE1_PWM3_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_PWM3_INTR_MAP_S  0

#define INTERRUPT_CORE1_LEDC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x88C)
/* INTERRUPT_CORE1_LEDC_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_LEDC_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_LEDC_INT_MAP_M  ((INTERRUPT_CORE1_LEDC_INT_MAP_V)<<(INTERRUPT_CORE1_LEDC_INT_MAP_S))
#define INTERRUPT_CORE1_LEDC_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_LEDC_INT_MAP_S  0

#define INTERRUPT_CORE1_EFUSE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x890)
/* INTERRUPT_CORE1_EFUSE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_EFUSE_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_EFUSE_INT_MAP_M  ((INTERRUPT_CORE1_EFUSE_INT_MAP_V)<<(INTERRUPT_CORE1_EFUSE_INT_MAP_S))
#define INTERRUPT_CORE1_EFUSE_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_EFUSE_INT_MAP_S  0

#define INTERRUPT_CORE1_CAN_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x894)
/* INTERRUPT_CORE1_CAN_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_CAN_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_CAN_INT_MAP_M  ((INTERRUPT_CORE1_CAN_INT_MAP_V)<<(INTERRUPT_CORE1_CAN_INT_MAP_S))
#define INTERRUPT_CORE1_CAN_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_CAN_INT_MAP_S  0

#define INTERRUPT_CORE1_USB_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x898)
/* INTERRUPT_CORE1_USB_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_USB_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_USB_INTR_MAP_M  ((INTERRUPT_CORE1_USB_INTR_MAP_V)<<(INTERRUPT_CORE1_USB_INTR_MAP_S))
#define INTERRUPT_CORE1_USB_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_USB_INTR_MAP_S  0

#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x89C)
/* INTERRUPT_CORE1_RTC_CORE_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_M  ((INTERRUPT_CORE1_RTC_CORE_INTR_MAP_V)<<(INTERRUPT_CORE1_RTC_CORE_INTR_MAP_S))
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_RTC_CORE_INTR_MAP_S  0

#define INTERRUPT_CORE1_RMT_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8A0)
/* INTERRUPT_CORE1_RMT_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RMT_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_RMT_INTR_MAP_M  ((INTERRUPT_CORE1_RMT_INTR_MAP_V)<<(INTERRUPT_CORE1_RMT_INTR_MAP_S))
#define INTERRUPT_CORE1_RMT_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_RMT_INTR_MAP_S  0

#define INTERRUPT_CORE1_PCNT_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8A4)
/* INTERRUPT_CORE1_PCNT_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_PCNT_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_PCNT_INTR_MAP_M  ((INTERRUPT_CORE1_PCNT_INTR_MAP_V)<<(INTERRUPT_CORE1_PCNT_INTR_MAP_S))
#define INTERRUPT_CORE1_PCNT_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_PCNT_INTR_MAP_S  0

#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8A8)
/* INTERRUPT_CORE1_I2C_EXT0_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_M  ((INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_V)<<(INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_S))
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_I2C_EXT0_INTR_MAP_S  0

#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8AC)
/* INTERRUPT_CORE1_I2C_EXT1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_M  ((INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_V)<<(INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_S))
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_I2C_EXT1_INTR_MAP_S  0

#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8B0)
/* INTERRUPT_CORE1_SPI2_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_M  ((INTERRUPT_CORE1_SPI2_DMA_INT_MAP_V)<<(INTERRUPT_CORE1_SPI2_DMA_INT_MAP_S))
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI2_DMA_INT_MAP_S  0

