espressif/esp-idf/components/soc/esp32s3/include/soc/interrupt_core1_reg.h
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8B4)
/* INTERRUPT_CORE1_SPI3_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_M  ((INTERRUPT_CORE1_SPI3_DMA_INT_MAP_V)<<(INTERRUPT_CORE1_SPI3_DMA_INT_MAP_S))
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI3_DMA_INT_MAP_S  0

#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8B8)
/* INTERRUPT_CORE1_SPI4_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_M  ((INTERRUPT_CORE1_SPI4_DMA_INT_MAP_V)<<(INTERRUPT_CORE1_SPI4_DMA_INT_MAP_S))
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI4_DMA_INT_MAP_S  0

#define INTERRUPT_CORE1_WDG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8BC)
/* INTERRUPT_CORE1_WDG_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_WDG_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_WDG_INT_MAP_M  ((INTERRUPT_CORE1_WDG_INT_MAP_V)<<(INTERRUPT_CORE1_WDG_INT_MAP_S))
#define INTERRUPT_CORE1_WDG_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_WDG_INT_MAP_S  0

#define INTERRUPT_CORE1_TIMER_INT1_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8C0)
/* INTERRUPT_CORE1_TIMER_INT1_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TIMER_INT1_MAP  0x0000001F
#define INTERRUPT_CORE1_TIMER_INT1_MAP_M  ((INTERRUPT_CORE1_TIMER_INT1_MAP_V)<<(INTERRUPT_CORE1_TIMER_INT1_MAP_S))
#define INTERRUPT_CORE1_TIMER_INT1_MAP_V  0x1F
#define INTERRUPT_CORE1_TIMER_INT1_MAP_S  0

#define INTERRUPT_CORE1_TIMER_INT2_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8C4)
/* INTERRUPT_CORE1_TIMER_INT2_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TIMER_INT2_MAP  0x0000001F
#define INTERRUPT_CORE1_TIMER_INT2_MAP_M  ((INTERRUPT_CORE1_TIMER_INT2_MAP_V)<<(INTERRUPT_CORE1_TIMER_INT2_MAP_S))
#define INTERRUPT_CORE1_TIMER_INT2_MAP_V  0x1F
#define INTERRUPT_CORE1_TIMER_INT2_MAP_S  0

#define INTERRUPT_CORE1_TG_T0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8C8)
/* INTERRUPT_CORE1_TG_T0_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TG_T0_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_TG_T0_INT_MAP_M  ((INTERRUPT_CORE1_TG_T0_INT_MAP_V)<<(INTERRUPT_CORE1_TG_T0_INT_MAP_S))
#define INTERRUPT_CORE1_TG_T0_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_TG_T0_INT_MAP_S  0

#define INTERRUPT_CORE1_TG_T1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8CC)
/* INTERRUPT_CORE1_TG_T1_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TG_T1_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_TG_T1_INT_MAP_M  ((INTERRUPT_CORE1_TG_T1_INT_MAP_V)<<(INTERRUPT_CORE1_TG_T1_INT_MAP_S))
#define INTERRUPT_CORE1_TG_T1_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_TG_T1_INT_MAP_S  0

#define INTERRUPT_CORE1_TG_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8D0)
/* INTERRUPT_CORE1_TG_WDT_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TG_WDT_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_TG_WDT_INT_MAP_M  ((INTERRUPT_CORE1_TG_WDT_INT_MAP_V)<<(INTERRUPT_CORE1_TG_WDT_INT_MAP_S))
#define INTERRUPT_CORE1_TG_WDT_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_TG_WDT_INT_MAP_S  0

#define INTERRUPT_CORE1_TG1_T0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8D4)
/* INTERRUPT_CORE1_TG1_T0_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TG1_T0_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_TG1_T0_INT_MAP_M  ((INTERRUPT_CORE1_TG1_T0_INT_MAP_V)<<(INTERRUPT_CORE1_TG1_T0_INT_MAP_S))
#define INTERRUPT_CORE1_TG1_T0_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_TG1_T0_INT_MAP_S  0

#define INTERRUPT_CORE1_TG1_T1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8D8)
/* INTERRUPT_CORE1_TG1_T1_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TG1_T1_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_TG1_T1_INT_MAP_M  ((INTERRUPT_CORE1_TG1_T1_INT_MAP_V)<<(INTERRUPT_CORE1_TG1_T1_INT_MAP_S))
#define INTERRUPT_CORE1_TG1_T1_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_TG1_T1_INT_MAP_S  0

#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8DC)
/* INTERRUPT_CORE1_TG1_WDT_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_M  ((INTERRUPT_CORE1_TG1_WDT_INT_MAP_V)<<(INTERRUPT_CORE1_TG1_WDT_INT_MAP_S))
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_TG1_WDT_INT_MAP_S  0

#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8E0)
/* INTERRUPT_CORE1_CACHE_IA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_M  ((INTERRUPT_CORE1_CACHE_IA_INT_MAP_V)<<(INTERRUPT_CORE1_CACHE_IA_INT_MAP_S))
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_CACHE_IA_INT_MAP_S  0

#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8E4)
/* INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_M  ((INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_V)<<(INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_S))
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_SYSTIMER_TARGET0_INT_MAP_S  0

#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8E8)
/* INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_M  ((INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_V)<<(INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_S))
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_SYSTIMER_TARGET1_INT_MAP_S  0

#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8EC)
/* INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_M  ((INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_V)<<(INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_S))
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_SYSTIMER_TARGET2_INT_MAP_S  0

#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8F0)
/* INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP  0x0000001F
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_M  ((INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_V)<<(INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_S))
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_V  0x1F
#define INTERRUPT_CORE1_SPI_MEM_REJECT_INTR_MAP_S  0

#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8F4)
/* INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_M  ((INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_V)<<(INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_S))
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DCACHE_PRELOAD_INT_MAP_S  0

#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8F8)
/* INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_M  ((INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_V)<<(INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_S))
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_ICACHE_PRELOAD_INT_MAP_S  0

#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x8FC)
/* INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_M  ((INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_V)<<(INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_S))
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DCACHE_SYNC_INT_MAP_S  0

