espressif/esp-idf/components/soc/esp32s3/include/soc/interrupt_core1_reg.h
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x900)
/* INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_M  ((INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_V)<<(INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_S))
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_ICACHE_SYNC_INT_MAP_S  0

#define INTERRUPT_CORE1_APB_ADC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x904)
/* INTERRUPT_CORE1_APB_ADC_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_APB_ADC_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_APB_ADC_INT_MAP_M  ((INTERRUPT_CORE1_APB_ADC_INT_MAP_V)<<(INTERRUPT_CORE1_APB_ADC_INT_MAP_S))
#define INTERRUPT_CORE1_APB_ADC_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_APB_ADC_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x908)
/* INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_M  ((INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_IN_CH0_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x90C)
/* INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_M  ((INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_IN_CH1_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x910)
/* INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_M  ((INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_IN_CH2_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x914)
/* INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_M  ((INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_IN_CH3_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x918)
/* INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_M  ((INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_IN_CH4_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x91C)
/* INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_M  ((INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_OUT_CH0_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x920)
/* INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_M  ((INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_OUT_CH1_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x924)
/* INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_M  ((INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_OUT_CH2_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x928)
/* INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_M  ((INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_OUT_CH3_INT_MAP_S  0

#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x92C)
/* INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_M  ((INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_V)<<(INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_S))
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_DMA_OUT_CH4_INT_MAP_S  0

#define INTERRUPT_CORE1_RSA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE1_BASE + 0x930)
/* INTERRUPT_CORE1_RSA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */
/*description: */
#define INTERRUPT_CORE1_RSA_INT_MAP  0x0000001F
#define INTERRUPT_CORE1_RSA_INT_MAP_M  ((INTERRUPT_CORE1_RSA_INT_MAP_V)<<(INTERRUPT_CORE1_RSA_INT_MAP_S))
#define INTERRUPT_CORE1_RSA_INT_MAP_V  0x1F
#define INTERRUPT_CORE1_RSA_INT_MAP_S  0

